function lab1_2() {
    'use strict'
    /*

    1 ворона
    2 вороны
    5 ворон 

    */


    var num = prompt('Сколько-сколько говоришь их на ветках..?', '');
    var n = num % 100;
    var n1 = num % 10;
    if (n1 == 1 && n != 11 && n >= 10) {
        alert('на ветке ' + num + ' ворона');
    } else if (n >= 10 && n <= 20 || n1 >= 5 && n1 <= 9) {
        alert('на ветке ' + num + ' ворон');
    } else if (n1 > 1 && n1 < 5 && n >= 10) {
        alert('на ветке ' + num + ' вороны');
    }
}